{"keras_version": "2.2.4", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "unit_forget_bias": true, "kernel_constraint": null, "unroll": false, "dropout": 0.0, "use_bias": true, "return_sequences": true, "kernel_regularizer": null, "trainable": true, "activation": "tanh", "name": "lstm_1", "batch_input_shape": [null, 6, 1], "units": 128, "go_backwards": false, "stateful": false, "implementation": 1, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_state": false, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "recurrent_regularizer": null, "dtype": "float32", "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"name": "dropout_1", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "unit_forget_bias": true, "kernel_constraint": null, "unroll": false, "dropout": 0.0, "use_bias": true, "return_sequences": true, "kernel_regularizer": null, "trainable": true, "activation": "tanh", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "lstm_2", "units": 50, "go_backwards": false, "stateful": false, "implementation": 1, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_state": false, "bias_regularizer": null, "bias_constraint": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"name": "dropout_2", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "unit_forget_bias": true, "kernel_constraint": null, "unroll": false, "dropout": 0.0, "use_bias": true, "return_sequences": true, "kernel_regularizer": null, "trainable": true, "activation": "tanh", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "lstm_3", "units": 50, "go_backwards": false, "stateful": false, "implementation": 1, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_state": false, "bias_regularizer": null, "bias_constraint": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"name": "dropout_3", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "unit_forget_bias": true, "kernel_constraint": null, "unroll": false, "dropout": 0.0, "use_bias": true, "return_sequences": false, "kernel_regularizer": null, "trainable": true, "activation": "tanh", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "lstm_4", "units": 50, "go_backwards": false, "stateful": false, "implementation": 1, "activity_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_state": false, "bias_regularizer": null, "bias_constraint": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"name": "dropout_4", "seed": null, "trainable": true, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "activation": "linear", "kernel_regularizer": null, "trainable": true, "name": "dense_1", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}]}, "class_name": "Sequential"}